Revit 2026 API

# StructuralConnectionHandlerTypeAddElementsToCustomConnection Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
public static void AddElementsToCustomConnection(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Reference> references
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>
Public Shared Sub AddElementsToCustomConnection (
	structuralConnectionHandler As StructuralConnectionHandler,
	references As IList(Of Reference)
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
static void AddElementsToCustomConnection(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Reference^>^ references
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>]
static member AddElementsToCustomConnection :
        structuralConnectionHandler : StructuralConnectionHandler *
        references : IList<Reference> -> unit
```

#### Parameters

structuralConnectionHandler StructuralConnectionHandler

references IListReference

#### Reference

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace